tutorials/D3TransCube/Allrun
#!/bin/bash
# Load OpenFOAM run functions
. "$WM_PROJECT_DIR/bin/tools/RunFunctions"

CASE_DIR="$(CDPATH= cd -- "$(dirname -- "$0")" && pwd)"
NDTBL_STAGING_SCRIPT="$CASE_DIR/../../scripts/ndtbl_table_staging.sh"
if [ ! -f "$NDTBL_STAGING_SCRIPT" ]; then
    echo "Missing ndtbl table staging helper: $NDTBL_STAGING_SCRIPT" >&2
    exit 1
fi
. "$NDTBL_STAGING_SCRIPT"

# User settings, overridable through environment variables
TABLERESOLUTION="${TABLERESOLUTION:-101}"      # select table resolution (2, 21, 31, 41, 46, 51)
TABLE_SUFFIX="${TABLE_SUFFIX:-f}"             # ndtbl precision suffix (f or d)
TABLE_LAYOUT="${TABLE_LAYOUT:-combined}"      # combined or split table files
PARALLEL="${PARALLEL:-true}"                  # parallel mode?
NPROCS="${NPROCS:-4}"                         # number of MPI ranks when parallel
HEAPTRACK="${HEAPTRACK:-false}"               # profile solver with heaptrack?
HEAPTRACK_OUT="${HEAPTRACK_OUT:-}"            # optional explicit heaptrack output file
PERF="${PERF:-false}"                         # profile solver with perf stat?
PERF_EVENTS="${PERF_EVENTS:-page-faults,minor-faults,major-faults}"
DROP_CACHES="${DROP_CACHES:-false}"           # local-PC testing only: drop filesystem caches before solver?
TABLE_FILE="constant/Tables.ndtbl"            # table path used by combustionProperties
TABLE_SHARED="constant/Tables.shared.ndtbl"   # shared source table for TMPDIR staging
TABLE_SOURCE="${TABLE_SOURCE:-}"              # optional pre-generated source/base table
# Split TABLE_SOURCE=/path/Tables.ndtbl expects sibling files named
# Tables.Table1.ndtbl, Tables.Table2.ndtbl, and Tables.Table3.ndtbl.
TABLE_TMP_SUBDIR="${TABLE_TMP_SUBDIR:-D3TransCube}"
TABLE_EVICT_CACHE="${TABLE_EVICT_CACHE:-true}"
TABLE_FIELDS=(Table1 Table2 Table3)
SPLIT_TABLE_FILES=(
    constant/Tables.Table1.ndtbl
    constant/Tables.Table2.ndtbl
    constant/Tables.Table3.ndtbl
)
SPLIT_TABLE_SHARED_FILES=(
    constant/Tables.shared.Table1.ndtbl
    constant/Tables.shared.Table2.ndtbl
    constant/Tables.shared.Table3.ndtbl
)
COMBUSTION_PROPERTIES="$CASE_DIR/constant/combustionProperties"

if [ "$TABLE_LAYOUT" != combined ] && [ "$TABLE_LAYOUT" != split ]; then
    echo "TABLE_LAYOUT must be 'combined' or 'split'." >&2
    exit 1
fi

if [ "$HEAPTRACK" = true ] && [ "$PERF" = true ]; then
    echo "HEAPTRACK=true and PERF=true are mutually exclusive." >&2
    exit 1
fi

runSolver()
{
    if [ "$HEAPTRACK" = true ]; then
        echo "Running under heaptrack: $*"
        if [ -n "$HEAPTRACK_OUT" ]; then
            heaptrack --record-only -o "$HEAPTRACK_OUT" "$@"
        else
            heaptrack --record-only "$@"
        fi
    elif [ "$PERF" = true ]; then
        echo "Running under perf stat: $*"
        perf stat -e "$PERF_EVENTS" "$@"
    else
        "$@"
    fi
}

splitTablePath()
{
    local base_path="$1"
    local field_name="$2"

    if [[ "$base_path" == *.ndtbl ]]; then
        printf "%s.%s.ndtbl\n" "${base_path%.ndtbl}" "$field_name"
    else
        printf "%s.%s.ndtbl\n" "$base_path" "$field_name"
    fi
}

configureTableFiles()
{
    local table_files=("$TABLE_FILE" "$TABLE_FILE" "$TABLE_FILE")
    if [ "$TABLE_LAYOUT" = split ]; then
        table_files=("${SPLIT_TABLE_FILES[@]}")
    fi

    python3 ./python/configureTableFiles.py \
        "$COMBUSTION_PROPERTIES" \
        "${table_files[@]}" || exit 1
}

prepareTables()
{
    local table_source="${TABLE_SOURCE:-}"

    if [ -z "$table_source" ]; then
        rm -f \
            "$TABLE_FILE" \
            "$TABLE_SHARED" \
            "${SPLIT_TABLE_FILES[@]}" \
            "${SPLIT_TABLE_SHARED_FILES[@]}"
        local generated_table="$TABLE_FILE"
        if [ -n "${TMPDIR:-}" ]; then
            generated_table="$TABLE_SHARED"
        fi

        python3 ./python/tableGenerator.py \
            "$TABLERESOLUTION" \
            "$TABLE_SUFFIX" \
            "$generated_table" \
            "$TABLE_LAYOUT" || exit 1

        if [ -z "${TMPDIR:-}" ]; then
            if [ "$TABLE_EVICT_CACHE" = true ]; then
                if [ "$TABLE_LAYOUT" = combined ]; then
                    ndtbl_evict_file_cache "$TABLE_FILE"
                else
                    local split_table
                    for split_table in "${SPLIT_TABLE_FILES[@]}"; do
                        ndtbl_evict_file_cache "$split_table"
                    done
                fi
            fi
            return
        fi

        table_source="$CASE_DIR/$TABLE_SHARED"
    fi

    if [ "$TABLE_LAYOUT" = combined ]; then
        ndtbl_stage_table \
            "$table_source" \
            "$TABLE_FILE" \
            "$TABLE_TMP_SUBDIR" \
            "Tables.ndtbl" \
            "$TABLE_EVICT_CACHE" || exit 1
        return
    fi

    local table_i
    for table_i in "${!TABLE_FIELDS[@]}"; do
        local split_source
        split_source="$(splitTablePath \
            "$table_source" \
            "${TABLE_FIELDS[$table_i]}")"
        ndtbl_stage_table \
            "$split_source" \
            "${SPLIT_TABLE_FILES[$table_i]}" \
            "$TABLE_TMP_SUBDIR" \
            "$(basename -- "${SPLIT_TABLE_FILES[$table_i]}")" \
            "$TABLE_EVICT_CACHE" || exit 1
    done
}

cd "$CASE_DIR" || exit 1

COMBUSTION_PROPERTIES_BACKUP="$(mktemp \
    "${TMPDIR:-/tmp}/D3TransCube-combustionProperties.XXXXXX")" || exit 1
cp "$COMBUSTION_PROPERTIES" "$COMBUSTION_PROPERTIES_BACKUP" || exit 1
DECOMPOSE_PAR_DICT=""
cleanupTemporaryFiles()
{
    cp "$COMBUSTION_PROPERTIES_BACKUP" "$COMBUSTION_PROPERTIES"
    rm -f "$COMBUSTION_PROPERTIES_BACKUP"
    if [ -n "$DECOMPOSE_PAR_DICT" ]; then
        rm -f "$DECOMPOSE_PAR_DICT"
    fi
}
trap cleanupTemporaryFiles EXIT
configureTableFiles

# Copy initial conditions
cp -rf 0_orig 0

# Create Mesh
runApplication blockMesh

# Create Tables
prepareTables

if [ "$DROP_CACHES" = true ]; then
    sync
    echo 3 | sudo tee /proc/sys/vm/drop_caches >/dev/null
fi

if [ "$PARALLEL" = true ]; then
    if [ "$HEAPTRACK" = true ]; then
        echo "HEAPTRACK=true is currently only supported for serial runs." >&2
        exit 1
    fi
    if [ "$PERF" = true ]; then
        echo "PERF=true is currently only supported for serial runs." >&2
        exit 1
    fi

    DECOMPOSE_PAR_DICT="$(mktemp \
        "${TMPDIR:-/tmp}/D3TransCube-decomposeParDict.XXXXXX")" || exit 1
    sed \
        -e "s/^numberOfSubdomains[[:space:]].*;/numberOfSubdomains $NPROCS;/" \
        -e "s/^n[[:space:]].*;/n ($NPROCS 1 1);/" \
        system/decomposeParDict > "$DECOMPOSE_PAR_DICT" || exit 1

    # Decompose case
    runApplication decomposePar -dict "$DECOMPOSE_PAR_DICT"

    # Run solver in parallel
    runParallel -np "$NPROCS" ndtblIntegrationFoam

    # Reconstruct results
    runApplication reconstructPar

    # Remove processor directories
    rm -rf processor*
else
    # Serial run
    runSolver ndtblIntegrationFoam 2>&1 | tee log.ndtblIntegrationFoam
fi

# Create ParaView/OpenFOAM reader marker
touch "$CASE_DIR/D3TransCube.foam"
